app/controllers/users_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@project = Project.find(1)
    @user = User.find(params[:id])